validation/openfoam/cylinder_re100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 8-block planar O-grid around the cylinder (R = 1, D = 2), embedded in
// a symmetric 30 D x 20 D channel that mirrors the AeroLab Validation
// preset (B = D / Ly = 2 / 20 = 5 %). Topology copied from the OpenFOAM
// 11 tutorial incompressibleFluid/offsetCylinder; the outer bounding box
// is enlarged and made symmetric so the blockage matches AeroLab and the
// cross-validation comparison is honest.
//
//   x in [-20, +40]   (10 D upstream, 20 D downstream)
//   y in [-20, +20]   (10 D each side, B = 5 %)
//   z in [-1, +1]     (single span cell, empty BCs - quasi-2D)
//
// Inner ring vertices sit on a circle r = 1 (cylinder) and r = sqrt(2)
// approx 1.414 (middle O-grid). Those numbers (1, 0.707107, 1.4,
// 0.989949) are unchanged from the tutorial -- only the outer bounding
// box coordinates 5 / -5 / 2.5 / -1.5 are rewritten to the symmetric
// 40 / -20 / 20 / -20.

convertToMeters 1;

vertices
(
    (1 0 -1)                                                // 0
    (1.4 0 -1)                                              // 1
    (40 0 -1)                                               // 2
    (40 0.989949 -1)                                        // 3
    (0.989949 0.989949 -1)                                  // 4
    (0.707107 0.707107 -1)                                  // 5
    (40 20 -1)                                              // 6
    (0.989949 20 -1)                                        // 7
    (0 20 -1)                                               // 8
    (0 1.4 -1)                                              // 9
    (0 1 -1)                                                // 10
    (-1 0 -1)                                               // 11
    (-1.4 0 -1)                                             // 12
    (-20 0 -1)                                              // 13
    (-20 0.989949 -1)                                       // 14
    (-0.989949 0.989949 -1)                                 // 15
    (-0.707107 0.707107 -1)                                 // 16
    (-20 20 -1)                                             // 17
    (-0.989949 20 -1)                                       // 18
    (40 -0.989949 -1)                                       // 19
    (0.989949 -0.989949 -1)                                 // 20
    (0.707107 -0.707107 -1)                                 // 21
    (40 -20 -1)                                             // 22
    (0.989949 -20 -1)                                       // 23
    (0 -20 -1)                                              // 24
    (0 -1.4 -1)                                             // 25
    (0 -1 -1)                                               // 26
    (-20 -0.989949 -1)                                      // 27
    (-0.989949 -0.989949 -1)                                // 28
    (-0.707107 -0.707107 -1)                                // 29
    (-20 -20 -1)                                            // 30
    (-0.989949 -20 -1)                                      // 31

    (1 0 1)                                                 // 32
    (1.4 0 1)                                               // 33
    (40 0 1)                                                // 34
    (40 0.989949 1)                                         // 35
    (0.989949 0.989949 1)                                   // 36
    (0.707107 0.707107 1)                                   // 37
    (40 20 1)                                               // 38
    (0.989949 20 1)                                         // 39
    (0 20 1)                                                // 40
    (0 1.4 1)                                               // 41
    (0 1 1)                                                 // 42
    (-1 0 1)                                                // 43
    (-1.4 0 1)                                              // 44
    (-20 0 1)                                               // 45
    (-20 0.989949 1)                                        // 46
    (-0.989949 0.989949 1)                                  // 47
    (-0.707107 0.707107 1)                                  // 48
    (-20 20 1)                                              // 49
    (-0.989949 20 1)                                        // 50
    (40 -0.989949 1)                                        // 51
    (0.989949 -0.989949 1)                                  // 52
    (0.707107 -0.707107 1)                                  // 53
    (40 -20 1)                                              // 54
    (0.989949 -20 1)                                        // 55
    (0 -20 1)                                               // 56
    (0 -1.4 1)                                              // 57
    (0 -1 1)                                                // 58
    (-20 -0.989949 1)                                       // 59
    (-0.989949 -0.989949 1)                                 // 60
    (-0.707107 -0.707107 1)                                 // 61
    (-20 -20 1)                                             // 62
    (-0.989949 -20 1)                                       // 63
);

// Cells per block. 25 x 25 x 1 = 625 cells/block. 20 blocks gives
// ~12 500 total cells. Plenty for Re = 100 laminar; the cylinder is
// sampled by 8 * 25 = 200 tangential cells -- about 1.8 deg/cell --
// and the boundary layer over the first ~D/8 distance is captured
// by the radial 25 cells in the inner ring.
blocks
(
    hex (5 4 9 10 37 36 41 42) (18 18 1) simpleGrading (1 1 1)
    hex (0 1 4 5 32 33 36 37) (18 18 1) simpleGrading (1 1 1)
    hex (1 2 3 4 33 34 35 36) (18 18 1) simpleGrading (1 1 1)
    hex (4 3 6 7 36 35 38 39) (18 18 1) simpleGrading (1 1 1)
    hex (9 4 7 8 41 36 39 40) (18 18 1) simpleGrading (1 1 1)
    hex (15 16 10 9 47 48 42 41) (18 18 1) simpleGrading (1 1 1)
    hex (12 11 16 15 44 43 48 47) (18 18 1) simpleGrading (1 1 1)
    hex (13 12 15 14 45 44 47 46) (18 18 1) simpleGrading (1 1 1)
    hex (14 15 18 17 46 47 50 49) (18 18 1) simpleGrading (1 1 1)
    hex (15 9 8 18 47 41 40 50) (18 18 1) simpleGrading (1 1 1)
    hex (26 25 20 21 58 57 52 53) (18 18 1) simpleGrading (1 1 1)
    hex (21 20 1 0 53 52 33 32) (18 18 1) simpleGrading (1 1 1)
    hex (20 19 2 1 52 51 34 33) (18 18 1) simpleGrading (1 1 1)
    hex (23 22 19 20 55 54 51 52) (18 18 1) simpleGrading (1 1 1)
    hex (24 23 20 25 56 55 52 57) (18 18 1) simpleGrading (1 1 1)
    hex (28 29 11 12 60 61 43 44) (18 18 1) simpleGrading (1 1 1)
    hex (25 26 29 28 57 58 61 60) (18 18 1) simpleGrading (1 1 1)
    hex (27 28 12 13 59 60 44 45) (18 18 1) simpleGrading (1 1 1)
    hex (30 31 28 27 62 63 60 59) (18 18 1) simpleGrading (1 1 1)
    hex (31 24 25 28 63 56 57 60) (18 18 1) simpleGrading (1 1 1)
);

edges
(
    arc 5 0 (0.92388 0.382683 -1)
    arc 5 10 (0.382683 0.923879 -1)
    arc 1 4 (1.29343 0.535757 -1)
    arc 4 9 (0.535757 1.29343 -1)
    arc 32 37 (0.92388 0.382683 1)
    arc 37 42 (0.382683 0.923879 1)
    arc 33 36 (1.29343 0.535757 1)
    arc 36 41 (0.535757 1.29343 1)
    arc 11 16 (-0.923879 0.382683 -1)
    arc 16 10 (-0.382683 0.923879 -1)
    arc 12 15 (-1.29343 0.535757 -1)
    arc 15 9 (-0.535757 1.29343 -1)
    arc 43 48 (-0.923879 0.382683 1)
    arc 48 42 (-0.382683 0.923879 1)
    arc 44 47 (-1.29343 0.535757 1)
    arc 47 41 (-0.535757 1.29343 1)
    arc 0 21 (0.923879 -0.382683 -1)
    arc 21 26 (0.382683 -0.923879 -1)
    arc 1 20 (1.29343 -0.535757 -1)
    arc 20 25 (0.535757 -1.29343 -1)
    arc 32 53 (0.923879 -0.382683 1)
    arc 53 58 (0.382683 -0.923879 1)
    arc 33 52 (1.29343 -0.535757 1)
    arc 52 57 (0.535757 -1.29343 1)
    arc 11 29 (-0.923879 -0.382683 -1)
    arc 29 26 (-0.382683 -0.923879 -1)
    arc 12 28 (-1.29343 -0.535757 -1)
    arc 28 25 (-0.535757 -1.29343 -1)
    arc 43 61 (-0.923879 -0.382683 1)
    arc 61 58 (-0.382683 -0.923879 1)
    arc 44 60 (-1.29343 -0.535757 1)
    arc 60 57 (-0.535757 -1.29343 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (17 14 46 49)
            (14 13 45 46)
            (13 27 59 45)
            (27 30 62 59)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (22 19 51 54)
            (19 2 34 51)
            (2 3 35 34)
            (3 6 38 35)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (30 31 63 62)
            (31 24 56 63)
            (24 23 55 56)
            (23 22 54 55)
        );
    }
    top
    {
        type patch;
        faces
        (
            (6 7 39 38)
            (7 8 40 39)
            (8 18 50 40)
            (18 17 49 50)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (0 5 37 32)
            (5 10 42 37)
            (10 16 48 42)
            (16 11 43 48)
            (11 29 61 43)
            (29 26 58 61)
            (26 21 53 58)
            (21 0 32 53)
        );
    }
);


// ************************************************************************* //
