validation/openfoam/cylinder_re100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

// Restart from latest written snapshot (t = 200) so the first 200
// time units of symmetric-wake development are kept and we just
// extend. The perfectly symmetric mesh / inlet locks the wake in a
// steady symmetric state for ~150 D/U before shedding bootstraps off
// floating-point asymmetry; at t = 200 Cl_std had reached 0.11 and
// was growing exponentially, so saturation lands inside the next
// ~20 D/U. endTime = 400 gives ~100 D/U of fully-developed shedding
// after saturation -- plenty for Cd mean and St FFT.
startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         400;

// dt = 0.01 keeps CFL < 0.3 in the finest cells near the cylinder
// (h_min ~ 0.056 with 18x18 mesh per block, U_max ~ 1.5 in the
// throat). PIMPLE is unconditionally stable but accuracy still wants
// CFL well under 1.
deltaT          0.01;

writeControl    runTime;

// Write fields every 10 D/U for visual sanity checks during the run.
writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// Force-coefficient time series. Written every time step into
// postProcessing/forceCoeffs/0/forceCoeffs.dat -- read by
// validation/compare_aerolab_vs_openfoam.py.
//
// rho = 1 (incompressible normalisation), |U_Inf| = 1, l_Ref = D = 2,
// A_Ref = D * span = 2 * 2 = 4. CofR is the cylinder axis.
functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;

        patches         (cylinder);

        rho             rhoInf;
        rhoInf          1;

        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);

        magUInf         1;
        lRef            2;
        Aref            4;

        CofR            (0 0 0);
    }
}


// ************************************************************************* //
