validation/openfoam/cylinder_re100/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-6;
        relTol          0.1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-5;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    // 2 outer + 1 inner = ~half the cost of the tutorial's 3+2 and
    // still safe for laminar Re=100 (PIMPLE is overkill here -- PISO
    // semantics emerge at outerCorrectors=1).
    nOuterCorrectors    2;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
    transportPredictionFirst yes;
}


// ************************************************************************* //
